from enum import StrEnum


class Action(StrEnum):
    WORKERS_CREATE = ("workers:create", "Додавання співробітників", "Дозволяє додавати співробітників")
    WORKERS_DELETE = ("workers:delete", "Видалення співробітників", "Дозволяє видаляти співробітників")
    WORKERS_EDIT = ("workers:edit", "Редагування співробітників", "Дозволяє редагувати інформацію про співробітників")
    WORKERS_LIST = ("workers:list", "Список співробітників", "Дозволяє переглядати список співробітників")
    WORKERS_VIEW = ("workers:view", "Перегляд співробітників", "Дозволяє переглядати інформацію про співробітників")

    ROLES_CREATE = ("roles:create", "Додавання ролей", "Дозволяє додавати ролі")
    ROLES_DELETE = ("roles:delete", "Видалення ролей", "Дозволяє видаляти роли")
    ROLES_EDIT = ("roles:edit", "Редагування ролей", "Дозволяє редагувати інформацию про роли")
    ROLES_LIST = ("roles:list", "Список ролей", "Дозволяє переглядати список ролей")
    ROLES_VIEW = ("roles:view", "Перегляд ролей", "Дозволяє переглядати информацию про роли")

    USERS_CREATE = ("users:create", "Додавання користувачів", "Дозволяє додавати користувачів")
    USERS_DELETE = ("users:delete", "Видалення користувачів", "Дозволяє видаляти користувачів")
    USERS_EDIT = ("users:edit", "Редагування користувачів", "Дозволяє редагувати інформацію про користувачів")
    USERS_LIST = ("users:list", "Список користувачів", "Дозволяє переглядати список користувачів")
    USERS_VIEW = ("users:view", "Перегляд користувачів", "Дозволяє переглядати інформацію про користувачів")

    CATEGORIES_CREATE = ("categories:create", "Додавання категорій", "Дозволяє додавати категорії")
    CATEGORIES_DELETE = ("categories:delete", "Видалення категорій", "Дозволяє видаляти категорії")
    CATEGORIES_EDIT = ("categories:edit", "Редагування категорій", "Дозволяє редагувати інформацію про категорії")
    CATEGORIES_LIST = ("categories:list", "Список категорій", "Дозволяє переглядати список категорій")
    CATEGORIES_VIEW = ("categories:view", "Перегляд категорій", "Дозволяє переглядати інформацію про категорії")

    OWNERS_CREATE = ("owners:create", "Додавання власників", "Дозволяє додавати власників")
    OWNERS_DELETE = ("owners:delete", "Видалення власників", "Дозволяє видаляти власників")
    OWNERS_EDIT = ("owners:edit", "Редагування власників", "Дозволяє редагувати інформацію про власників")
    OWNERS_LIST = ("owners:list", "Список власників", "Дозволяє переглядати список власників")
    OWNERS_VIEW = ("owners:view", "Перегляд власників", "Дозволяє переглядати інформацію про власників")

    PAYMENT_TYPE_CREATE = ("payment_types:create", "Додавання типів оплати", "Дозволяє додавати типи оплати")
    PAYMENT_TYPE_DELETE = ("payment_types:delete", "Видалення типів оплати", "Дозволяє видаляти типи оплати")
    PAYMENT_TYPE_EDIT = ("payment_types:edit", "Редагування типів оплати", "Дозволяє редагувати інформацію про типи оплати")
    PAYMENT_TYPE_LIST = ("payment_types:list", "Список типів оплати", "Дозволяє переглядати список типів оплати")
    PAYMENT_TYPE_VIEW = ("payment_types:view", "Перегляд типів оплати", "Дозволяє переглядати інформацію про типи оплати")

    NDS_RATES_CREATE = ("nds_rates:create", "Додавання ставок ПДВ", "Дозволяє додавати ставки ПДВ")
    NDS_RATES_DELETE = ("nds_rates:delete", "Видалення ставок ПДВ", "Дозволяє видаляти ставки ПДВ")
    NDS_RATES_EDIT = ("nds_rates:edit", "Редагування ставок ПДВ", "Дозволяє редагувати інформацію про ставки ПДВ")
    NDS_RATES_LIST = ("nds_rates:list", "Список ставок ПДВ", "Дозволяє переглядати список ставок ПДВ")
    NDS_RATES_VIEW = ("nds_rates:view", "Перегляд ставок ПДВ", "Дозволяє переглядати інформацію про ставки ПДВ")

    ADMISSIONS_CREATE = ("admissions:create", "Додавання постачань", "Дозволяє створювати постачання")
    ADMISSIONS_DELETE = ("admissions:delete", "Видалення постачань", "Дозволяє видаляти постачання")
    ADMISSIONS_EDIT = ("admissions:edit", "Редагування постачань", "Дозволяє редагувати постачання")
    ADMISSIONS_LIST = ("admissions:list", "Список постачань", "Дозволяє переглядати список постачань")
    ADMISSIONS_VIEW = ("admissions:view", "Перегляд постачань", "Дозволяє переглядати інформацію про постачання")

    WRITE_OFFS_CREATE = ("write_offs:create", "Додавання списань", "Дозволяє створювати списання")
    WRITE_OFFS_DELETE = ("write_offs:delete", "Скасування списань", "Дозволяє скасовувати списання")
    WRITE_OFFS_EDIT = ("write_offs:edit", "Редагування списань", "Дозволяє редагувати списання")
    WRITE_OFFS_LIST = ("write_offs:list", "Список списань", "Дозволяє переглядати список списань")
    WRITE_OFFS_VIEW = ("write_offs:view", "Перегляд списань", "Дозволяє переглядати інформацію про списання")

    MOVEMENTS_CREATE = ("movements:create", "Додавання переміщень", "Дозволяє створювати переміщення")
    MOVEMENTS_DELETE = ("movements:delete", "Скасування переміщень", "Дозволяє скасовувати переміщення")
    MOVEMENTS_EDIT = ("movements:edit", "Редагування переміщень", "Дозволяє редагувати переміщення")
    MOVEMENTS_LIST = ("movements:list", "Список переміщень", "Дозволяє переглядати список переміщень")
    MOVEMENTS_VIEW = ("movements:view", "Перегляд переміщень", "Дозволяє переглядати інформацію про переміщення")

    ISSUES_CREATE = ("issues:create", "Додавання видач", "Дозволяє створювати видачі")
    ISSUES_DELETE = ("issues:delete", "Видалення видач", "Дозволяє видаляти видачі")
    ISSUES_EDIT = ("issues:edit", "Редагування видач", "Дозволяє редагувати видачі")
    ISSUES_LIST = ("issues:list", "Список видач", "Дозволяє переглядати список видач")
    ISSUES_VIEW = ("issues:view", "Перегляд видач", "Дозволяє переглядати інформацію про видачі")

    SALES_CREATE = ("sales:create", "Додавання продажів", "Дозволяє створювати продажі")
    SALES_DELETE = ("sales:delete", "Скасування продажів", "Дозволяє скасовувати продажі")
    SALES_EDIT = ("sales:edit", "Редагування продажів", "Дозволяє редагувати продажі")
    SALES_LIST = ("sales:list", "Список продажів", "Дозволяє переглядати список продажів")
    SALES_VIEW = ("sales:view", "Перегляд продажів", "Дозволяє переглядати інформацію про продажі")

    RETURNS_CREATE = ("returns:create", "Додавання повернень", "Дозволяє створювати повернення ТМЦ із площадок/відділів")
    RETURNS_DELETE = ("returns:delete", "Скасування повернень", "Дозволяє скасовувати повернення")
    RETURNS_EDIT = ("returns:edit", "Редагування повернень", "Дозволяє редагувати повернення")
    RETURNS_LIST = ("returns:list", "Список повернень", "Дозволяє переглядати список повернень")
    RETURNS_VIEW = ("returns:view", "Перегляд повернень", "Дозволяє переглядати інформацію про повернення")

    SALE_RETURNS_CREATE = ("sale_returns:create", "Додавання повернень продажу", "Дозволяє створювати повернення проданого ТМЦ на склад")
    SALE_RETURNS_DELETE = ("sale_returns:delete", "Скасування повернень продажу", "Дозволяє скасовувати повернення продажу")
    SALE_RETURNS_EDIT = ("sale_returns:edit", "Редагування повернень продажу", "Дозволяє редагувати повернення продажу")
    SALE_RETURNS_LIST = ("sale_returns:list", "Список повернень продажу", "Дозволяє переглядати список повернень продажу")
    SALE_RETURNS_VIEW = ("sale_returns:view", "Перегляд повернень продажу", "Дозволяє переглядати інформацію про повернення продажу")

    REQUESTS_CREATE = ("requests:create", "Додавання заявок", "Дозволяє створювати заявки на видачу/продаж")
    REQUESTS_DELETE = ("requests:delete", "Видалення заявок", "Дозволяє видаляти заявки")
    REQUESTS_EDIT = ("requests:edit", "Редагування заявок", "Дозволяє редагувати невиконані заявки")
    REQUESTS_LIST = ("requests:list", "Список усіх заявок", "Дозволяє переглядати всі заявки (оператор)")
    REQUESTS_VIEW = ("requests:view", "Перегляд заявок", "Дозволяє переглядати інформацію про заявки")
    REQUESTS_PROCESS = ("requests:process", "Обробка заявок", "Дозволяє формувати рух ТМЦ за заявкою")

    STORAGE_CREATE = ("storage:create", "Додавання складів", "Дозволяє додавати склади")
    STORAGE_DELETE = ("storage:delete", "Видалення складів", "Дозволяє видаляти склади")
    STORAGE_EDIT = ("storage:edit", "Редагування складів", "Дозволяє редагувати інформацію про склади")
    STORAGE_LIST = ("storage:list", "Список складів", "Дозволяє переглядати список складів")
    STORAGE_VIEW = ("storage:view", "Перегляд складів", "Дозволяє переглядати інформацію про склади")

    SUPPLIERS_CREATE = ("suppliers:create", "Додавання постачальників", "Дозволяє додавати постачальників")
    SUPPLIERS_DELETE = ("suppliers:delete", "Видалення постачальників", "Дозволяє видаляти постачальників")
    SUPPLIERS_EDIT = ("suppliers:edit", "Редагування постачальників", "Дозволяє редагувати інформацію про постачальників")
    SUPPLIERS_LIST = ("suppliers:list", "Список постачальників", "Дозволяє переглядати список постачальників")
    SUPPLIERS_VIEW = ("suppliers:view", "Перегляд постачальників", "Дозволяє переглядати інформацію про постачальників")
    
    PRODUCTS_CREATE = ("products:create", "Додавання позицій  каталогу товарів", "Дозволяє додавати нові позиції товарів до каталогу")
    PRODUCTS_DELETE = ("products:delete", "Видалення позицій каталогу товарів", "Дозволяє видаляти позиції з каталогу товарів")
    PRODUCTS_EDIT = ("products:edit", "Редагування позицій каталогу товарів", "Дозволяє редагувати позиції каталогу товарів")
    PRODUCTS_LIST = ("products:list", "Перегляд каталогу товарів", "Дозволяє перегляд каталогу товарів")
    PRODUCTS_VIEW = ("products:view", "Деталізований перегляд каталогу товарів", "Дозволяє деталізований перегляд позицій каталогу товарів")

    REPORTS_STOCK = ("reports:stock", "Звіт «Наявність ТМЦ»", "Дозволяє переглядати звіт про наявність ТМЦ на місцях зберігання")
    REPORTS_UNITS = ("reports:units", "Звіт «Одиниці ТМЦ»", "Дозволяє переглядати перелік і деталі окремих одиниць ТМЦ")

    def __new__(cls, code: str, title: str, description: str):
        obj = str.__new__(cls, code)
        obj._value_ = code
        obj.title_attr = title
        obj.description_attr = description
        return obj
